app/views/rooms/index.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
          <div id="messages">
            <% @room.messages.each do |message| %> <br>